In [10]:
import pandas as pd

In [4]:
data = {
    "a": [1, 2, 3],
    "b": [4, 5, 6],
}

df = pd.DataFrame(data, index=["ratio", "flop", "coubeh"])
df

        a  b
ratio   1  4
flop    2  5
coubeh  3  6

In [34]:
df = pd.read_csv("Automobile_data.csv", index_col=0)
df.dropna()
df.shift(1)
prices = df["price"]
prices.shift(1)
prices.describe()
prices.fillna(prices.mean(), inplace=True)
df.isnull().sum()

company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               0
dtype: int64

In [5]:
df = pd.read_json("data.json")
df

   a  b
0  1  4
1  2  5
2  3  6

In [20]:
import sqlite3
con = sqlite3.connect("tutorial.db")
cur = con.cursor()
cur.execute("CREATE TABLE if not exists movies (title, director, score)")
cur.execute("INSERT INTO movies VALUES ('The Matrix', 'Wachowski', 87)")
con.commit()
df = pd.read_sql_query("SELECT * FROM movies", con)
df.head()

        title   director  score
0  The Matrix  Wachowski     87
1  The Matrix  Wachowski     87
2  The Matrix  Wachowski     87
3  The Matrix  Wachowski     87
4  The Matrix  Wachowski     87